In [2]:
import pandas as pd
x=pd.Series([1,2,3])
x

0    1
1    2
2    3
dtype: int64

# Missing values in pandas

In [5]:
data1={'Odisha':17,'Bengal':15}
data2={'Odisha':4,'Delhi':7}
d1=pd.Series(data1)
d2=pd.Series(data2)
d1+d2

Bengal     NaN
Delhi      NaN
Odisha    21.0
dtype: float64

# Data frame creation

In [2]:
import pandas as pd
data={"state":["Delhi(NCT)","Gujurat","Maharastra","Odisha","uttarakhand"],"CM":["Atishi Marlena","Bhupendra Patel","Eknath shinde","Mohan charan Majhi","Pushkar singh Dhami"],"pop":[4.37,10.43,13.10,5.2,3.2]}
frame=pd.DataFrame(data) # it represents a rectangular table of data
frame

         state                   CM    pop
0   Delhi(NCT)       Atishi Marlena   4.37
1      Gujurat      Bhupendra Patel  10.43
2   Maharastra        Eknath shinde  13.10
3       Odisha   Mohan charan Majhi   5.20
4  uttarakhand  Pushkar singh Dhami   3.20

In [3]:
frame.head(3)# it returns the first 3 rows

        state               CM    pop
0  Delhi(NCT)   Atishi Marlena   4.37
1     Gujurat  Bhupendra Patel  10.43
2  Maharastra    Eknath shinde  13.10

In [4]:
frame.tail(2) # it returns last 2 rows

         state                   CM  pop
3       Odisha   Mohan charan Majhi  5.2
4  uttarakhand  Pushkar singh Dhami  3.2

In [5]:
frame.head() # by default it gives first five rows

         state                   CM    pop
0   Delhi(NCT)       Atishi Marlena   4.37
1      Gujurat      Bhupendra Patel  10.43
2   Maharastra        Eknath shinde  13.10
3       Odisha   Mohan charan Majhi   5.20
4  uttarakhand  Pushkar singh Dhami   3.20

In [6]:
frame.tail()# by default it gives last five rows

         state                   CM    pop
0   Delhi(NCT)       Atishi Marlena   4.37
1      Gujurat      Bhupendra Patel  10.43
2   Maharastra        Eknath shinde  13.10
3       Odisha   Mohan charan Majhi   5.20
4  uttarakhand  Pushkar singh Dhami   3.20

In [7]:
frame.columns # it gives all the columns in the data

Index(['state', 'CM', 'pop'], dtype='object')

In [8]:
frame1=pd.DataFrame(data,columns=["CM","pop","State","Loan_amt"])
frame1.columns

Index(['CM', 'pop', 'State', 'Loan_amt'], dtype='object')

KeyError: 'State'

In [9]:
frame1.CM

0         Atishi Marlena
1        Bhupendra Patel
2          Eknath shinde
3     Mohan charan Majhi
4    Pushkar singh Dhami
Name: CM, dtype: object

In [10]:
frame1.Loan_amt

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
Name: Loan_amt, dtype: object

In [11]:
frame1['Loan_amt']=23 # here columns can be modified by assignment
frame1

                    CM    pop State  Loan_amt
0       Atishi Marlena   4.37   NaN        23
1      Bhupendra Patel  10.43   NaN        23
2        Eknath shinde  13.10   NaN        23
3   Mohan charan Majhi   5.20   NaN        23
4  Pushkar singh Dhami   3.20   NaN        23

In [12]:
frame1['Loan_amt']=[3.4,7.8,6.7,9.8,5.3] # we can pass a array for individual columns.
frame1

                    CM    pop State  Loan_amt
0       Atishi Marlena   4.37   NaN       3.4
1      Bhupendra Patel  10.43   NaN       7.8
2        Eknath shinde  13.10   NaN       6.7
3   Mohan charan Majhi   5.20   NaN       9.8
4  Pushkar singh Dhami   3.20   NaN       5.3

In [13]:
import pandas as pd
frame2=pd.DataFrame(data,columns=["CM","pop","State","Loan_amt"])
val=pd.Series([3.4,6.7,9.8],index=[0,1,3]) # here you can assign the values to specific indexes.
frame2['Loan_amt']=val
frame2

                    CM    pop State  Loan_amt
0       Atishi Marlena   4.37   NaN       3.4
1      Bhupendra Patel  10.43   NaN       6.7
2        Eknath shinde  13.10   NaN       NaN
3   Mohan charan Majhi   5.20   NaN       9.8
4  Pushkar singh Dhami   3.20   NaN       NaN

# creat a new col and deleting

In [14]:
frame1['capital']='Bhubaneswar'
frame1

                    CM    pop State  Loan_amt      capital
0       Atishi Marlena   4.37   NaN       3.4  Bhubaneswar
1      Bhupendra Patel  10.43   NaN       7.8  Bhubaneswar
2        Eknath shinde  13.10   NaN       6.7  Bhubaneswar
3   Mohan charan Majhi   5.20   NaN       9.8  Bhubaneswar
4  Pushkar singh Dhami   3.20   NaN       5.3  Bhubaneswar

In [16]:
del frame1['capital']
frame1

                    CM    pop State  Loan_amt
0       Atishi Marlena   4.37   NaN       3.4
1      Bhupendra Patel  10.43   NaN       7.8
2        Eknath shinde  13.10   NaN       6.7
3   Mohan charan Majhi   5.20   NaN       9.8
4  Pushkar singh Dhami   3.20   NaN       5.3

In [17]:
GDP={"India":{2015:2.1,2020:2.7,2025:5},"USA":{2015:18.4,2020:21.06,2025:25},"Japan":{2015:4.4,2020:5.0,2025:5.4}}
frame3=pd.DataFrame(GDP)
frame3

      India    USA  Japan
2015    2.1  18.40    4.4
2020    2.7  21.06    5.0
2025    5.0  25.00    5.4

In [19]:
x={"MS dhoni":{"Match1":25,"Match2":56,"Match3":79},"Virat":{"Match1":22,"Match2":20,"Match3":56},"Shubhman":{"Match1":56,"Match2":10,"Match3":15},"Rohit":{"Match1":52,"Match2":272,"Match3":25}}
frame4=pd.DataFrame(x)
frame4

        MS dhoni  Virat  Shubhman  Rohit
Match1        25     22        56     52
Match2        56     20        10    272
Match3        79     56        15     25

# creating DataFrame using numpy array

In [21]:
import numpy as np
a=np.array([[1,2],[3,4],[5,6]]) #not more than 2d
a=pd.DataFrame(a,index=['r1','r2','r3'],columns=['c1','c2'])#a.columns=['c1','c2']
a

    c1  c2
r1   1   2
r2   3   4
r3   5   6

In [24]:
data=[['virat',35],['Dhoni',42],['shubman',24]]
df=pd.DataFrame(data,columns=['Name','Age'])
df

      Name  Age
0    virat   35
1    Dhoni   42
2  shubman   24

In [25]:
data=[{'a':1,'b':2,'c':3},{'a':10,'b':20,'c':30,'d':7}] # creating dataframe from list of dictionary
df=pd.DataFrame(data)
df

    a   b   c    d
0   1   2   3  NaN
1  10  20  30  7.0

In [29]:
import pandas as pd
data=[{'dhoni':25,'virat':22,"shubman":56,"rohit":52},{'dhoni':23,'virat':50,"shubman":55,"rohit":54},{'dhoni':34,'virat':93,"shubman":67,"rohit":56},{'dhoni':38,'virat':90,"shubman":76,"rohit":82}]
df=pd.DataFrame(data,index=["Match1","Match2","Match3","Match4"])
df

        dhoni  virat  shubman  rohit
Match1     25     22       56     52
Match2     23     50       55     54
Match3     34     93       67     56
Match4     38     90       76     82

In [30]:
d={'one':pd.Series([10,20,30,40],index=['a','b','c','d']),'two':pd.Series([10,20,30,40],index=['a','b','c','d'])}
df=pd.DataFrame(d) # creating dataframe from dictionary of series
df

   one  two
a   10   10
b   20   20
c   30   30
d   40   40

In [33]:
import pandas as pd
frame3=pd.DataFrame(GDP)
frame3.index.name='year'
frame3.columns.name='country' # naming index and columns.
frame3

country  India    USA  Japan
year
2015       2.1  18.40    4.4
2020       2.7  21.06    5.0
2025       5.0  25.00    5.4

In [34]:
df=pd.DataFrame(['a','b','c'],index=[1,2,3])
I=df.index
print(I[2])

3

In [35]:
print(I.shape)
print(I.size)
print(I.dtype)
print(I.ndim)

(3,)
3
int64
1

In [36]:
labels=pd.Index(np.arange(1,4))
print('labels',labels)
pd.Series([1.5,-2.5,0],index=labels)

labels Int64Index([1, 2, 3], dtype='int64')

1    1.5
2   -2.5
3    0.0
dtype: float64